app/Controllers/Main.php

    public function admin()
    {
        if (array_key_exists('user_session', session()->get())) {
            $qturl_m = new \App\Models\CuteUrl();
            $user = session()->get('user_session');

            $data['user'] = $user;
            $data['urls'] = $qturl_m
                ->where('user_id', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `cute_url`
WHERE `user_id` = '2'
ORDER BY `dtc` DESC

    public function users()
    {
        if (array_key_exists('user_session', session()->get())) {

            $user_m = new \App\Models\UserAccount();

            $user = session()->get('user_session');

            if (array_key_exists('user_id', $this->request->getGet())) {

                $data['edit_user'] = $user_m->find($this->request->getGet('user_id'));
            }

            $data['user'] = $user;
            $data['users'] = $user_m
                ->where('id !=', $user['id'])
                ->orderBy('dtc', 'desc')
                ->findAll();
---
SELECT *
FROM `users`
WHERE `users`.`id` = '10'
SELECT *
FROM `users`
WHERE `id` != '2'
ORDER BY `dtc` DESC

                $random_code = strtolower(random_string('alnum',32));
                $short_code = strtolower(random_string('alnum',8));

                $qturl_m->save([
                    'source_url' => $source_url,
                    'target_code' => $random_code,
                    'custom' => $short_code,
                    'user_id' => $user['id'],
                ]);
---
INSERT INTO `cute_url` (`source_url`, `target_code`, `custom`, `user_id`) VALUES ('https://github.com/janieyam', 'oqejfsagycx4l3bimj6dwgftas5pbn8k', 'tzbj5syq', '2')

    public function shortcut_url($custom)
    {
        $qturl_m = new \App\Models\CuteUrl();
        $qturl_d = $qturl_m->where('custom', $custom)->findAll();
---
SELECT *
FROM `cute_url`
WHERE `custom` = 'tzbj5syq'